
#ifndef _BAIDU_SDK_H_
#define _BAIDU_SDK_H_

//#include "amcomdef.h"
//#include "asvloffscreen.h"

#ifdef __cplusplus
extern "C"
{
#endif

#define BAIDU_NONE				0x00000000	//无属性
#define BAIDU_FACE_DETECT			0x00000001	//此处detect可以是tracking或者detection两个引擎之一，具体的选择由detect mode 确定
#define BAIDU_FACERECOGNITION		0x00000004	//人脸特征
#define BAIDU_AGE					0x00000008	//年龄
#define BAIDU_GENDER				0x00000010	//性别
#define BAIDU_FACE3DANGLE			0x00000020	//3D角度
#define BAIDU_FACELANDMARK		0x00000040	//额头区域特征点
#define BAIDU_LIVENESS			0x00000080	//RGB活体
#define BAIDU_IMAGEQUALITY		0x00000200	//图像质量检测
#define BAIDU_IR_LIVENESS			0x00000400	//IR活体
#define BAIDU_FACESHELTER			0x00000800  //人脸遮挡
#define BAIDU_MASKDETECT			0x00001000	//口罩检测

#define MOK								(0)

typedef unsigned char			MByte;

//检测模式
enum DetectMode
{
	DETECT_MODE_VIDEO = 0x00000000,		//Video模式，一般用于多帧连续检测
	DETECT_MODE_IMAGE = 0xFFFFFFFF		//Image模式，一般用于静态图的单次检测
};

//检测时候人脸角度的优先级，在文档中初始化接口中有图示说明，请参考
enum BAIDU_OrientPriority
{
	BAIDU_OP_0_ONLY = 0x1,		// 常规预览下正方向
	BAIDU_OP_90_ONLY = 0x2,		// 基于0°逆时针旋转90°的方向
	BAIDU_OP_270_ONLY = 0x3,		// 基于0°逆时针旋转270°的方向
	BAIDU_OP_180_ONLY = 0x4,		// 基于0°旋转180°的方向（逆时针、顺时针效果一样）
	BAIDU_OP_ALL_OUT = 0x5		// 全角度
};

//orientation 角度，逆时针方向
enum BAIDU_OrientCode
{
	BAIDU_OC_0 = 0x1,			// 0 degree
	BAIDU_OC_90 = 0x2,		// 90 degree
	BAIDU_OC_270 = 0x3,		// 270 degree
	BAIDU_OC_180 = 0x4,   	// 180 degree
	BAIDU_OC_30 = 0x5,		// 30 degree
	BAIDU_OC_60 = 0x6,		// 60 degree
	BAIDU_OC_120 = 0x7,		// 120 degree
	BAIDU_OC_150 = 0x8,		// 150 degree
	BAIDU_OC_210 = 0x9,		// 210 degree
	BAIDU_OC_240 = 0xa,		// 240 degree
	BAIDU_OC_300 = 0xb,		// 300 degree
	BAIDU_OC_330 = 0xc		// 330 degree
};

//检测模型
enum BAIDU_DetectModel
{
	BAIDU_DETECT_MODEL_RGB = 0x1	//RGB图像检测模型
//预留扩展其他检测模型
};

//人脸比对可选的模型
enum BAIDU_CompareModel
{
	BAIDU_LIFE_PHOTO = 0x1,	//用于生活照之间的特征比对，推荐阈值0.80
	BAIDU_ID_PHOTO = 0x2		//用于证件照或生活照与证件照之间的特征比对，推荐阈值0.82
};

enum BAIDU_RegisterOrNot
{
	BAIDU_RECOGNITION = 0x0,  //用于识别照人脸特征提取
	BAIDU_REGISTER = 0x1      //用于注册照人脸特征提取
};

//版本信息
typedef struct
{
	char* Version;				// 版本号
	char* BuildDate;			// 构建日期
	char* CopyRight;			// Copyright
} BAIDU_VERSION, *LPBAIDU_VERSION;

//图像数据
//typedef LPASVLOFFSCREEN LPBAIDU_ImageData;
#if 1
//typedef struct __tag_rect
typedef struct
{
	int left;
	int top;
	int right;
	int bottom;
} BRECT, *PBRECT;
#endif 


//单人脸信息
typedef struct
{
	BRECT faceRect;		// 人脸框信息
	int faceOrient;		// 输入图像的角度，可以参考 ArcFaceCompare_OrientCode
} BAIDU_SingleFaceInfo, *LPBAIDU_SingleFaceInfo;

//多人脸信息
typedef struct
{
	BRECT* faceRect;			// 人脸框信息
	int* faceOrient;		// 输入图像的角度，可以参考 ArcFaceCompare_OrientCode .
	int faceNum;			// 检测到的人脸个数
	int* faceID;			// face ID，IMAGE模式下不返回FaceID
	float* wear_glasses;		//戴眼镜状态,0 未戴眼镜；1 戴眼镜
	int* left_eye_closed;	//左眼状态 0 未闭眼；1 闭眼
	int* right_eye_closed;	//右眼状态 0 未闭眼；1 闭眼
} BAIDU_MultiFaceInfo, *LPBAIDU_MultiFaceInfo;

// 激活文件信息
typedef struct
{
	char* startTime;		//开始时间
	char* endTime;			//截止时间
	char* activeKey;		//激活码
	char* platform;		//平台
	char* sdkType;			//sdk类型
	char* appId;			//APPID
	char* sdkKey;			//SDKKEY
	char* sdkVersion;		//SDK版本号
	char* fileVersion;		//激活文件版本号
} BAIDU_ActiveFileInfo, *LPBAIDU_ActiveFileInfo;

/*******************************************************************************************
 * 获取激活文件信息接口
 *******************************************************************************************/

/*******************************************************************************************
 * 在线激活接口
 *******************************************************************************************/


/*******************************************************************************************
 * 获取设备信息接口
 *******************************************************************************************/


/*******************************************************************************************
 * 离线激活接口
 *******************************************************************************************/

/************************************************************************
 * 初始化引擎
 ************************************************************************/

/******************************************************
 * VIDEO模式:人脸追踪 IMAGE模式:人脸检测
 ******************************************************/


/******************************************************
 * VIDEO模式:人脸追踪 IMAGE模式:人脸检测
 * 图像数据以结构体形式传入，对采用更高字节对齐方式的图像兼容性更好
 ******************************************************/


/************************************************************************
 * 年龄/性别/人脸3D角度/口罩/遮挡/额头区域（该接口仅支持RGB图像），最多支持4张人脸信息检测，超过部分返回未知
 * RGB活体仅支持单人脸检测，该接口不支持检测IR活体
 ************************************************************************/


/************************************************************************
 * 年龄/性别/人脸3D角度/口罩/遮挡/额头区域（该接口仅支持RGB图像），最多支持4张人脸信息检测，超过部分返回未知
 * RGB活体仅支持单人脸检测，该接口不支持检测IR活体
 * 图像数据以结构体形式传入，对采用更高字节对齐方式的图像兼容性更好
 ************************************************************************/

/************************************************************************
 * 该接口目前仅支持单人脸IR活体检测，默认取第一张人脸
 ************************************************************************/


/************************************************************************
 * 该接口目前仅支持单人脸IR活体检测，默认取第一张人脸
 * 图像数据以结构体形式传入，对采用更高字节对齐方式的图像兼容性更好
 ************************************************************************/


/************************************************************************
 * 销毁引擎
 ************************************************************************/


/************************************************************************
 * 获取版本信息
 ************************************************************************/


//******************************** 人脸识别相关 *********************************************

typedef struct
{
	MByte* feature;		// 人脸特征信息
	int featureSize;	// 人脸特征信息长度
} BAIDU_FaceFeature, *LPBAIDU_FaceFeature;

/************************************************************************
 * 单人脸特征提取
 ************************************************************************/


/************************************************************************
 * 单人脸特征提取
 * 图像数据以结构体形式传入，对采用更高字节对齐方式的图像兼容性更好
 ************************************************************************/


/************************************************************************
 * 人脸特征比对，推荐阈值 BAIDU_LIFE_PHOTO：0.80  BAIDU_ID_PHOTO：0.82
 ************************************************************************/


//******************************** 年龄相关 **********************************************
typedef struct
{
	int* ageArray;				// "0" 代表不确定，大于0的数值代表检测出来的年龄结果
	int num;					// 检测的人脸个数
} BAIDU_AgeInfo, *LPBAIDU_AgeInfo;

/************************************************************************
 * 获取年龄信息
 ************************************************************************/

//******************************** 性别相关 **********************************************
typedef struct
{
	int* genderArray;			// "0" 表示 男性, "1" 表示 女性, "-1" 表示不确定
	int num;					// 检测的人脸个数
} BAIDU_GenderInfo, *LPBAIDU_GenderInfo;

/************************************************************************
 * 获取性别信息
 ************************************************************************/


//******************************** 人脸3D 角度信息 ***********************************
typedef struct
{
	float* roll;
	float* yaw;
	float* pitch;
	int* status;					//0: 正常，其他数值：出错
	int num;
} BAIDU_Face3DAngle, *LPBAIDU_Face3DAngle;

/************************************************************************
 * 获取3D角度信息
 ************************************************************************/


//******************************** 图像质量检测相关 **********************************************
typedef struct
{
	float *faceQualityValue;	//人脸质量
	int num;                 //人脸数量
} BAIDU_ImageQualityInfo, *LPBAIDU_ImageQualityInfo;

/******************************************************
 * 图像质量检测，推荐阈值0.35
 * 图像数据以结构体形式传入，对采用更高字节对齐方式的图像兼容性更好
 ******************************************************/


//******************************** 活体信息 ***********************************
typedef struct
{
	float thresholdmodel_BGR;
	float thresholdmodel_IR;
} BAIDU_LivenessThreshold, *LPBAIDU_LivenessThreshold;

/************************************************************************
 * 取值范围[0-1]，默认值 BGR:0.5 IR:0.7， 用户可以根据实际需求，设置不同的阈值
 ************************************************************************/


typedef struct
{
	int* isLive;			// [out] 判断是否真人， 0：非真人；
	// 0:非真人； 1:真人；
	// -1：不确定； -2:传入人脸数 > 1；-3: 人脸过小；-4: 角度过大；-5: 人脸超出边界；-6: 深度图错误；-7: 红外图太亮了；
	int num;
} BAIDU_LivenessInfo, *LPBAIDU_LivenessInfo;

/************************************************************************
 * 获取RGB活体结果
 ************************************************************************/


/************************************************************************
 * 获取IR活体结果
 ************************************************************************/


//******************************** 遮挡检测相关 ***********************************
typedef struct
{
	int* FaceShelter;			    //"1" 表示 遮挡, "0" 表示  未遮挡, "-1" 表示不确定
	int num;
} BAIDU_FaceShelter, *LPBAIDU_FaceShelter;

/************************************************************************
 * 取值范围[0-1]， 默认阈值:0.8， 用户可以根据实际需求，设置不同的阈值
 ************************************************************************/


/************************************************************************
 * 获取遮挡检测的结果
 ************************************************************************/


//******************************** 口罩检测相关 **********************************************
typedef struct
{
	int* maskArray;				// "0" 代表没有带口罩，"1"代表带口罩 ,"-1"表不确定
	int num;					// 检测的人脸个数
} BAIDU_MaskInfo, *LPBAIDU_MaskInfo;

/************************************************************************
 * 获取口罩检测的结果
 ************************************************************************/


//******************************** 额头区域检测相关 **********************************************

#define LANDMARKS_NUM 4	//特征点个数

typedef struct
{
	float x;
	float y;
} BAIDU_FaceLandmark, *LPBAIDU_FaceLandmark;

typedef struct
{
	BAIDU_FaceLandmark *point;		//额头点位
	int num;						//人脸数量
} BAIDU_LandMarkInfo, *LPBAIDU_LandMarkInfo;

/************************************************************************
 * 获取额头区域检测结果（当前只支持0, 90, 180, 270度角检测）
 ************************************************************************/


#ifdef __cplusplus
}
#endif
#endif
